app/controllers/sources_controller.rb

SELECT "sources".* FROM "sources" WHERE (user_id = 7)
---
  def index
    #se asigna la variable a todos las fuentes que sean del autor logueado
    @sources = Source.where(["user_id = ?", session[:user_id]]).all

SELECT "sources".* FROM "sources" WHERE "sources"."id" = $1 LIMIT 1  [["id", "2"]]
---
  def show
    @source = Source.find(params[:id])

SELECT "sources".* FROM "sources" WHERE "sources"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
	@source = Source.find(params[:id])

INSERT INTO "sources" ("author", "created_at", "edition", "magazine_num", "pages", "pub_date", "pub_day", "pub_house", "pub_month", "pub_place", "pub_year", "ref_date", "ref_day", "ref_month", "ref_type", "ref_year", "title", "title2", "updated_at", "user_id", "volume", "website") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22) RETURNING "id"
---
  def create
    @source = Source.new(params[:source])

    respond_to do |format|
      if @source.save

SELECT "sources".* FROM "sources" WHERE "sources"."id" = $1 LIMIT 1  [["id", "10"]]
DELETE FROM "sources" WHERE "sources"."id" = $1  [["id", 10]]
---
  def destroy
    @source = Source.find(params[:id])
    @source.destroy