app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "password_hash", "password_salt", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "users" SET "password_salt" = '$2a$10$4gnvB5lU4jqXKVtsNJ1Ssu', "password_hash" = '$2a$10$4gnvB5lU4jqXKVtsNJ1Ssu1vx5fiL6v4JSaPVTmHSDFTJh9xoT5uC', "updated_at" = '2012-10-05 06:10:21.013183' WHERE "users"."id" = 1